     DNum              S              2S 0
     C                   Eval      Num=%ABS(15-20)
     C     Num           Dsply
     C                   Eval      *Inlr=*On
