     DVarible1         S              4S 2 INZ(10.38)
     DVarible2         S              4S 2 INZ(17.78)
     DResult           S              4S 1
     C     Varible1      Add       Varible2      Result
     C     Result        Dsply
     C                   Clear                   Result
     C     Varible1      Add(H)    Varible2      Result
     C     Result        Dsply
     **
     C                   Eval      *Inlr=*On
