     FArr2_pf   IT   F   10        Disk
     DArray1           S             10A   Dim(7) Fromfile(Arr2_pf)
     Di                S              2S 0 Inz(1)
     C
     C                   For       i=1 to 7
     C     Array1(i)     Dsply
     C                   Endfor
     C
     C                   Eval      *Inlr=*On
