     Fflatfile1 IT   F   30        Disk
     DArray1           S             30A   Dim(7) Fromfile(flatfile1)
     Di                S              2S 0 Inz(1)
     C
     C                   For       i=1 to 2
     C     Array1(i)     Dsply
     C                   Endfor
     C
     C                   Eval      *Inlr=*On
