     DResult           S              2S 0
     DNum1             S              2S 0 Inz(70)
     DNum2             S              2S 0 Inz(7)
     DNum3             S              2S 0 Inz(64)
     C     Num1          Div       Num2          Result
     C     Result        Dsply
     C                   Sqrt      Num3          Result
     C     Result        Dsply
     C                   Eval      *Inlr=*On
