     DString           S             10A
     DOutput           S             10S 0
     C                   Eval      String='Sahil Bhusari'
     C                   Eval      Output=%Check('Sail Busri':String:4)
     C     Output        Dsply
     C                   Eval      Output=%Checkr('Sail Busri':String)
     C     Output        Dsply
     C                   Eval      *Inlr=*On
