     DDate1            S               D
     DResult           S               D
     C                   Eval      Date1=%Date(*ISO)
     C     Date1         Dsply
     C                   Eval      *Inlr=*On
