     DDs_pdds1        SDS
     D Proc_Name         *Proc
     D Pgm_Status        *Status
     D Pgm_Lib                81     90
     D Date                  191    198
     D Century               199    202S 0
     D User                  254    263
     C     Proc_Name     Dsply
     C     Pgm_Status    Dsply
     C     Pgm_Lib       Dsply
     C     Date          Dsply
     C     Century       Dsply
     C     User          Dsply
     C                   Eval      *Inlr=*On
