**free

  Dcl-Ds FullName;
    FirstName Char(10);
    LastName Char(10);
  End-Ds;

  Dsply 'Enter firstname:' ''FirstName;
  Dsply 'Enter lastname:' ''LastName;

  Dsply FullName;

  *Inlr=*On;
