     dstring1          s             20a
     c                   eval      string1='hello aadarsh here'
     c     string1       dsply
     c                   return
