     H Nomain
     P Addition        B                   Export
     D Addition        PI             4S 0
     DNumber1                         2S 0
     DNumber2                         2S 0

     DResult           S              4S 0

     C                   Eval      Result = Number1 + Number2
     C                   Return    Result

     P Addition        E
