     H Option(*nodebugio) Bnddir('BND3')
     H DFTACTGRP(*NO)
     *************** Prototype declare *****************
     **
     DAddition         Pr
     **
     *************** Call procedure ********************
     **
     C                   CallP     Addition()
     C
     C                   Eval      *inlr=*on
