     H Nomain

     PSubtraction      B                   Export
     DSubtraction      PI             5S 0
     DNum1                            5S 0 Value
     DNum2                            5S 0 Value
     DNum3                            5S 0 Value
     Dresult           S              5S 0

     C                   Eval      Result=Num1-Num2-Num3
     C                   Return    Result
     PSubtraction      E
