     H BNDDIR('BNDDR1')
     C                   CallB     'ILEPGM81'
     C                   CallB     'ILEPGM82'
     C                   Eval      *Inlr=*On
