     D ILEPGM71        PR                  EXTPGM('ILEPGM71')
     D ILEPGM72        PR                  EXTPGM('ILEPGM72')
     C                   CallP     ILEPGM71
     C                   CallP     ILEPGM72
     C                   Eval      *Inlr=*On
