     Dindex            S              2S 0
     C
     C                   for       index=1 to 10
     C     index         dsply
     C                   select
     C                   when      %rem(index:2)=0
     C     'even'        dsply
     C
     C                   when      %rem(index:2) = 1
     C     'odd'         dsply
     C                   endsl
     C                   endfor
     C
     C                   eval      *inlr=*on
