     C     *ENTRY        PLIST1
     C                   PARM                    userid           30
     C                   PARM                    password         30
     C
     C     userid        dsply
     C
     C                   seton                                        lr
