     C     plist1        PLIST
     C                   PARM                    userid           30
     C                   PARM                    password         30
     C
     C                   eval      userid = 'sahil23'
     C                   eval      password = '1234567'
     C
     C                   call      'PLIST_1'     plist1
     C
     C                   seton                                        lr
