     C     Plist1        Plist
     C                   Parm                    User_Id          10
     C                   Parm                    Password         10

     C                   Eval      User_Id='Aadarsh'
     C                   Eval      Password='123456'

     C                   Call      'PROGB'       Plist1

     C                   Eval      *Inlr=*On
