     C     *Entry        Plist
     C                   Parm                    User_Id          10
     C                   Parm                    Password         10
     C     User_Id       Dsply
     C     Password      Dsply

     C                   Eval      *Inlr=*On
