     **free
       Dcl-F Pf2hdh Disk Usage(*Input) Keyed;
       EMP_ID=101;
       EMP_NAME='Aadarsh';
       Chain (EMP_ID:EMP_NAME) Pf2hdh;
       Dsply EMP_NAME;
       *Inlr=*On;
