     DString           S             10A   Inz('Aadarsh')
     DPos              S              2S 0
     DIndex            S              2S 0 Inz(12)
     **
     C     ' '           Scan(E)   String:Index  Pos
     C                   If        %Error
     C     'Error'       Dsply
     C                   Endif
     **
     C                   Eval      *Inlr=*On
