     DCur_Date         S               D
     DRes_Date         S               D
     C                   MoveL     *Date         Cur_Date
     C     Cur_Date      Subdur    01:*Y         Res_Date
     C     Res_Date      Dsply
     C     Cur_Date      Subdur    01:*M         Res_Date
     C     Res_Date      Dsply
     C     Cur_Date      Subdur    01:*D         Res_Date
     C     Res_Date      Dsply

     C                   Eval      *Inlr=*On
