     Dvarible1         s              4S 2 INZ(25.38)
     Dvarible2         S              4S 2 INZ(17.22)
     Dresult           S              4S 1
     C     varible1      SUB       varible2      result
     C     result        Dsply
     C                   clear                   result
     **
     C     varible1      SUB(H)    varible2      result
     C     result        Dsply
     **
     C                   eval      *inlr=*on
