     DString           S             10A   Inz('Aadarsh')
     DOutput           S             10A
     C                   Eval      Output=%Subst(String:2:5)
     C     Output        Dsply
     C                   Eval      *Inlr=*On
