     dnum1             s             20s 0
     dnum2             s             20s 0
     dsum              s             20s 0
     c                   eval      num1=20
     c                   eval      num2=10
     c     num1          add       num2          sum
     c     sum           dsply
     c                   return
