     **free
       Dcl-S String Char(25);
       Dcl-S Answer Char(25);
       String='my name is aadarsh';
       Answer=%upper(String);
       Dsply Answer;
       *Inlr=*On;
