     **free
       Dcl-s Num Zoned(10);
       Num=1;
       Dow Num<=20;
           Dsply Num;
           Num=Num+1;
       EndDo;
       *Inlr=*On;
