     **free
       Dcl-s  Num Zoned(10);
       Num=1;
       dow Num<=10;
           Dsply (Num*9);
           Num=Num+1;
       EndDo;
       *Inlr=*On;
